SIMISA@@@@@@@@@@JINX0D0t______

Wagon ( 4994E
	Type ( Engine )
	WagonShape ( 4994E.s )
	
	Size ( 2.76m 4.03m 11.6m )
	CentreOfGravity ( 0m 0m 0.65m )
	Centre ( 0m 2.08255m 0.300261m )
	Mass ( 75t )
	InertiaTensor ( Box (2.76m 4.03m 11.1m) )
	Coupling (
                  Type ( Bar )
                  Spring (
                          Stiffness ( 1e7N/m 1e7N/m )
                          Damping ( 0.2e7N/m/s 0.2e7N/m/s )
                          Break ( 7e9N 7e9N )
                          r0 ( 0cm 1e9 )
                         )
                  CouplingHasRigidConnection (1)
                  Velocity (0.1m/s)
                 )
        Coupling (
                  Type ( Chain )
                  Spring (
                          Stiffness ( 1e6N/m 2e6N/m )
                          Damping ( 1e6N/m/S 1e6N/m/S )
                          Break ( 7e9N 7e9N )
                          r0 ( 20cm 40cm )
                          )
                 Velocity ( 0.1m/s )
                 )
  Buffers (
           Spring (
                   Stiffness ( 1e6N/m 5e6N/m )
                   Damping ( 1e6N/m/s 1e6N/m/s )
                   r0 ( 0cm 1e9 )
                  )
          Centre ( 1.5 )
          Radius ( 1 )
          Angle ( 2.5deg )
         )
	Adheasion ( 0.28 0.395 2 0.5 )
	DerailRailHeight ( 4cm )
	DerailRailForce ( 240kN )
	DerailBufferForce ( 800kN )
	WheelRadius ( 0.75m )
	NumWheels ( 4 )
	Friction ( 
		1795N/m/s       0      1mph	         16.15N/m/s        1.8
		5.1N/rad/s      1     -1rad/s               0               1
	)
	BrakeEquipmentType ( "Vacuum_brake, Handbrake, Auxilary_reservoir" )
	BrakeSystemType ( "Vacuum_single_pipe" )
	MaxBrakeForce( 85kN )
	MaxHandbrakeForce( 45kN )
	NumberOfHandbrakeLeverSteps( 100 )
      AuxilaryLeakRate( 0.1 )
	MaxReleaseRate( 3 )
	MaxApplicationRate( 2 )
	MaxAuxilaryChargingRate( 4 )
	BrakeCylinderPressureForMaxBrakeBrakeForce( 25 )        
	Sound ( "..\\..\\common.sound\\2cyl_generic\\2c-100d-eng01.sms" )

      FreightAnim ( "..\\common.crew\\LIB_1\\Black5.s" 0 3.0 0.0 )

	Lights	( 6


		Light (
			Comment( light_ )
			Type ( 0 )
			Conditions (
				Headlight ( 3 )
			)
			Cycle ( 0 )
			FadeIn ( 0.5 )
			FadeOut ( 0.5 )
			States ( 1
				State (
					Duration ( 0.0 )
					LightColour ( 80E3E3E3 )
					Position ( -0.84 1.48 5.08 )
					Transition ( 0 )
					Radius ( 1.0 )
				)
			)
		)
		Light (
			Comment( light_ )
			Type ( 0 )
			Conditions (
				Headlight ( 3 )
			)
			Cycle ( 0 )
			FadeIn ( 0.5 )
			FadeOut ( 0.5 )
			States ( 1
				State (
					Duration ( 0.0 )
					LightColour ( 80E3E3E3 )
					Position ( 0.84 1.48 5.08 )
					Transition ( 0 )
					Radius ( 1.0 )
				)
			)
		)

		Light	(
			comment( Cab glow )
			Type		( 0 )
			Conditions	(
				Headlight ( 0 )
				Unit ( 0 )
			)
			FadeIn	( 0.5 )
			FadeOut	( 0.5 )
			Cycle		( 0 )
			States	(	1
				State	(
					Duration ( 0.0 )
					LightColour ( 80ff7200 )
					Position ( 0 2.1 -4.5 )
					Azimuth ( -180 -180 -180 )
					Transition ( 0 )
					Radius ( 1 )
					)
				)
			)

		Light	(
			comment( Flickering firebox )
			Type		( 0 )
			Conditions	(
				Headlight ( 0 )
				Unit ( 0 )
				)
			FadeIn	( 0.5 )
			FadeOut	( 0.5 )
			Cycle	( 0 )
			States	(	2
				State	(
					Duration ( 0.05 )
					LightColour ( 80ff7200 )
					Position ( 0 2.0 -4.4 )
					Azimuth ( -180 -180 -180 )
					Transition ( 0 )
					Radius ( 1.4 )
					)
				State	(
					Duration ( 0.05 )
					LightColour ( 80ffe610 )
					Position ( 0 2.0 -4.4 )
					Azimuth ( -180 -180 -180 )
					Transition ( 0 )
					Radius ( 1.4 )
					)
				)
			)
			Light	(
			comment( flickering fire underneath LHS )
				Type		( 0 )
				Conditions	(
				Headlight ( 0 )
				TimeOfDay ( 2 )
				Unit ( 0 )
			)
				FadeIn	( 0.5 )
				FadeOut	( 0.5 )
				Cycle ( 0 )
				States	(	4
					State	(
						Duration ( 0.02 )
						LightColour ( aaffa200 )
						Position ( -0.5 0.7 -3.3 )
						Azimuth ( -45 -90 -135 )
						Transition ( 0 )
						Radius ( 3 )									)
					State	(
						Duration ( 0.01 )
						LightColour ( aaffae00 )
						Position (-0.5 0.7 -3.3)
						Azimuth ( -45 -90 -135 )
						Transition ( 0 )
						Radius ( 1 )
						)
					State	(
						Duration ( 0.03 )
						LightColour ( aaffa900 )
						Position (-0.5 0.7 -3.3 )
						Azimuth ( -45 -90 -135 )
						Transition ( 0 )
						Radius ( 2 )									)
					State	(
						Duration ( 0.01 )
						LightColour ( aaffa000 )
						Position (-0.5 0.7 -3.3 )
						Azimuth ( -45 -90 -135 )
						Transition ( 0 )
						Radius ( 4 )									)
				)
			)

		Light	(
			comment( flickering fire underneath RHS )
				Type		( 0 )
				Conditions	(
				Headlight ( 0 )
				TimeOfDay ( 2 )
				Unit ( 0 )
			)
				FadeIn	( 0.5 )
				FadeOut	( 0.5 )
				Cycle ( 0 )
				States	(	4
					State	(
						Duration ( 0.02 )
						LightColour ( aaffa200 )
						Position ( 0.5 0.7 -3.3 )
						Azimuth ( 45 90 135 )
						Transition ( 0 )
						Radius ( 3 )									)
					State	(
						Duration ( 0.01 )
						LightColour ( aaffae00 )
						Position (0.5 0.7 -3.3)
						Azimuth ( 45 90 135 )
						Transition ( 0 )
						Radius ( 3 )
						)
					State	(
						Duration ( 0.03 )
						LightColour ( aaffa900 )
						Position (0.5 0.7 -3.3 )
						Azimuth ( 45 90 135 )
						Transition ( 0 )
						Radius ( 2 )									)
					State	(
						Duration ( 0.01 )
						LightColour ( aaffa000 )
						Position (0.5 0.7 -3.3 )
						Azimuth ( 45 90 135 )
						Transition ( 0 )
						Radius ( 4 )									)
				)
			)
		)
  	)

Engine ( 4994E
	Effects (
		SteamSpecialEffects
		(
			StackFX
			(
				0 4.12791 3.4
				0 1 0
				.1
			)
			SafetyValvesFX
			(
				0 3.8 -0.75
				0 1 0
				.1
			)
			WhistleFX
			(
				0 4.02336 -3.97124
				0 1 0
				.1
			)
			CylindersFX
			(
				1.1 0.7 4.1
				0 0 1
				0.1
			)
			CylindersFX
			(
				-1.1 0.7 4.1
				0 0 1
				0.1
			)
		)
	)

	Wagon ( 4994E )
	IsTenderRequired( 1 )	
	Type ( Steam )
	MaxPower ( 1500kW )
	MaxForce ( 27275lbf )
	MaxVelocity ( 80mph )
	WheelRadius ( 0.5m )
	Sanding ( 1e9mph )
	NumWheels ( 3 )
	BoilerLength ( 3.5m )
	BoilerVolume ( "225*(ft^3)" )
	BoilerEffectivity ( 1.26 )
	DraftingEffect ( 0.8 )
	BoilerResponsiveness ( 1.22 )
	CoalBurnage ( 4.5lb/hp/h )
	MaxBoilerOutput ( 32500lb/h )
	NumCylinders ( 2 )
	CylinderStroke ( 26in )
	CylinderDiameter ( 16in )
	CylinderVolume ( "8.83*(ft^3)" )
	CylinderEffectivity ( 1 )
	InjectorSizes ( 9mm 10mm )
	ExhaustLimit ( 36000lb/h )
	PrimingFactor ( 0.95 )
	BlastExponent ( 0.9 )
	MaxBoilerPressure ( 225psi )
	MaxFireMass ( 2400lb )
	IdealFireMass ( 1700lb )
	MaxWaterMass ( 4000lb )  
	SafetyValvesSteamUsage ( 8000lb/h )
	ShovelCoalMass ( 9.5lb )
	SmokeCombustion ( 1 )
	MaxTenderCoalMass ( 13440lb )
	MaxTenderWaterMass ( 40000lb )

	comment(0 for live steam, 1 for exhaust steam)
	InjectorTypes( 0 1 ) 
	SuperHeater ( 1.11 )
	SteamSmokeUnitsPerPoundOfFuel( 4 )
	SteamMaxSmokeUnitsReleaseRate( 10 )
	MaxSteamHeatingPressure( 80 )
	SafetyValvePressureDifference( 7 )
	SteamGaugeGlassHeight( 10 )
	BasicSteamUsage ( 620lb/h )
	BasicCoalUsage ( 110lb/h )

	comment( min steam pressure, min water proportion, max water proportion  )
	InjectorLimits1 ( 50psi 0.6 1 )
	InjectorLimits2 ( 60psi 0 1 )
	CylinderCocksPowerEfficiency ( 0.9 )
	SteamCylinderCocksOperation( Manual )

        VacuumBrakesSmallEjectorPowerRating( 3 )
	VacuumBrakesMinBoilerPressureMaxVacuum( 110 )
	VacuumBrakesSmallEjectorUsageRate( 450 )
	VacuumBrakesLargeEjectorUsageRate( 2000 )
	VacuumBrakesHasVacuumPump( 0 )

	TrainBrakesControllerMaxApplicationRate( 9 )
      TrainBrakesControllerMaxReleaseRate( 9 )
	TrainBrakesControllerMinSystemPressure( 0 )
	TrainBrakesControllerMaxSystemPressure( 25 )

	EngineBrakesControllerHasProportionalBrake( 1 )
        EngineBrakesProportionalBrakeLag( 0.9 )

	BrakesEngineBrakeType ( "Vacuum_single_pipe"  )
	BrakesTrainBrakeType ( "Vacuum_single_pipe" )
        BrakesEngineControllers( "Hand, Train" )

	SteamSmallestCutoff( 0.8 )
	NumberOfDamperSteps( 50 )

	RegulatorValveType ( Twin_port )
	RegulatorSecondValveStartPosition( 0.5 )
	RegulatorPilotValveExponent( 1.7 )
	RegulatorSecondValveExponent( 1.7 )
	RegulatorPilotValveFullOpenning( 0.3 )
	RegulatorMainValveInitialOpenning( 0.4 )

	SteamBlowerEffectExponent( 0.9 )
	SteamBlowerEfficiencyExponent( 1.1 )
	SteamBlowerMaxSteamUsageRate( 500 )	comment( lbs/h )
	SteamBlowerMaxProportionOfBlastEffect( 0.15 )

	SteamWaterScoopMinPickupSpeed( 25 )	comment( mph )
	SteamWaterScoopMaxPickupSpeed( 60 )	comment( mph )
	SteamWaterScoopResistance( 8500N )
	comment( pounds per second. 6000gallons per minute max. )
	SteamWaterScoopMaxPickupRate( 1000 )
	
	SteamSmokeUnitsPerPoundOfFuel( 6.3 )

	CabView ( Manor.cvf )
	HeadOut (  1.7 3.1 -5.5 )

        EngineControllers (
            comment( Engine controls )
        
            Regulator ( 0 1 0.025 0 
                NumNotches( 0 )
            )
 		Cutoff ( -0.75 0.75 0.0075 0 
 		NumNotches( 15
 			Notch ( -0.75 0 Dummy )
 			Notch ( -0.65 0 Dummy )
 			Notch ( -0.55 0 Dummy )
 			Notch ( -0.45 0 Dummy )
 			Notch ( -0.35 0 Dummy )
 			Notch ( -0.25 0 Dummy )
 			Notch ( -0.15 0 Dummy )
 			Notch ( 0.0 0 Dummy )
 			Notch ( 0.15 0 Dummy )
 			Notch ( 0.25 0 Dummy )
 			Notch ( 0.35 0 Dummy )
 			Notch ( 0.45 0 Dummy )
 			Notch ( 0.55 0 Dummy )
 			Notch ( 0.65 0 Dummy )
 			Notch ( 0.75 0 Dummy )
		)

            )
            Brake_Train ( 0 1 0.0375 0.65 
                NumNotches( 3
			Notch( 0 1 TrainBrakesControllerReleaseStart )
			Notch(0.01 1 TrainBrakesControllerRunningStart )
			Notch(0.2 1 TrainBrakesControllerApplyStart )
                )
            )
            Brake_Hand ( 0 1 0.0125 0 
                NumNotches( 0 )
            )
            FireDoor ( 0 1 0.1 0 
                NumNotches( 0 )
            )
            Sanding( 0 1 0 )
            Blower ( 0 1 0.025 0.2 
                NumNotches( 0 )
            )
            HeatingTap ( 0 1 0.025 0 
                NumNotches( 0 )
            )
            Shovel ( 0 1 0.1 0 
                NumNotches( 0 )
            )
            DampersFront ( 0 1 0.1 1 
                NumNotches( 0 )
            )
            DampersBack ( 0 1 0.1 0 
                NumNotches( 0 )
            )
            Injector1Steam ( 0 1 0 )
            Injector2Steam ( 0 1 0 )
            Injector1Water ( 0 1 0.1 0 
                NumNotches( 0 )
            )
            Injector2Water ( 0 1 0.1 0 
                NumNotches( 0 )
            )
            CylinderCocks ( 0 1 1 )
            Whistle ( 0 1 0 )
            WaterScoop ( 0 1 0 )
            SmallEjectorOrCompressor( 0 1 1 )
            Headlights( 0 1 0 )
        )

	comment(fire temp, fire mass, water mass, boiler pressure,
		water level, tender_water_mass, tender_coal_mass,
		smoke_quantity, fire_condition, coal quality )
		
	EngineVariables( 700 1350 2750 230 0.9 40000 1 425 0.9 0.95 )	Sound ( "..\\..\\common.sound\\2cyl_generic\\2c-100d-cab01.sms" )


    	Name ( "4994 Downton Hall (Early)" )
 	Description (
 	"The Hall class was introduced in 1924. Collett realised there was a need for a more powerful mixed traffic loco taking into account the increased amount of goods traffic that was emerging. He decided to modify an existing design, namely the Saint Class by fitting them with six foot coupled wheels in place of the existing  six foot eight and a half inches. So successful was this class, they were still being constructed well into BR days, albeit in a modified form designed by Hawksworth.\n\n"
 

	)
	EngineOperatingProcedures (
	"To move forward\n"+
	"1.	Press the W key several times to move the Reverser to full Forward.\n"+
	"2.	Press the ; (SEMICOLON) key to release the train brakes.\n"+
	"3.	Press the D key to increase the Regulator setting.\n"+  
	"4.	As you accelerate, press the S key to slowly reduce the Reverser setting, then adjust the Regulator to maintain the desired speed.\n\n"+
	"To slow the train\n"+
	"1.	Press the A key to move the Regulator to a lower setting.\n"+
	"2.	Use the brakes to further reduce speed if desired.\n\n"+
	"To apply the train brakes\n"+
	"1.	Press the ' (APOSTROPHE) key to apply the train brakes.\n"+
	"2. To hold the brakes at their current setting, lower the brake lever until it's in its middle (Neutral) position, by pressing the ; (SEMICOLON) key.\n\n"+
	"To release the train brakes\n"+
	"1. Press  the ; (SEMICOLON) key to release the train brakes.\n"+
	"2. When the brakes are released, raise the brake lever until it's in its middle (Neutral) position, by pressing the ' (APOSTROPHE) key.\n\n"+
	"To back up\n"+
	"1.	Bring your train to a full stop.\n"+ 
	"2.	Press the S key several times to move the Reverser to the full Reverse position.\n"+
	"4.	Press the ; (SEMICOLON) key to release the brakes.\n"+
	"5.	Slowly advance the regulator (D key).\n\n"+
	"To load and unload passengers\n"+
	"1. Stop at a station.\n"+
	"2. Press the ENTER key.\n"+
	"3. Wait for the \"permission to depart\" whistle.\n"+
	"TIP: Use the Next Station driving aid (F10) to monitor loading and unloading.\n\n"+
	"To couple to a car or locomotive\n"+
	"1. Coast into the unit at a very slow speed, about 2 mph.\n"+
	"TIP: To use the Coupling view, press the 6 key.\n"+
	"2. Press F9 to open the Train Operations window.\n"+
	"3. If the icon for the unit you coupled to is red, the handbrake is on. Double-click the car to release the handbrake.\n"+
	"4. Close the Train Operations window.\n\n"+
	"To uncouple from a car or locomotive\n"+
	"1. Press F9 to open the Train Operations window.\n"+
	"2. Double-click a unit in the part of the train you want to uncouple from the locomotive, to set the handbrake.\n"+
	"3. Double-click the coupler between the units you want to uncouple and the rest of the train.\n"+
	"4. Close the Train Operations window.\n\n"+
	"Firing commands (Automatic Fireman OFF in Options screen)\n"+
	"To add coal to the firebox\n"+
	"1. Press the F key to open the Firebox door.\n"+
	"2. Press the R key to increase the shoveling rate.\n\n"+
	"To stop adding coal to the fire\n"+
	"1. Press SHIFT+R to decrease the shoveling rate.\n"+
	"2. Press SHIFT+F to close the firebox door.\n\n"+
	"To operate the blower\n"+
	"1.	Press the N key to increase the blower.\n"+
	"2. Press SHIFT+N to decrease the blower.\n\n"+
	"To operate the dampers\n"+
	"1.	Press the M key to open the dampers.\n"+
	"2. Press SHIFT+M to close the dampers.\n\n"+
	"To inject water into the boiler\n"+
	"1.	Press the I key to turn on the steam to Injector 1.\n"+
	"(You can also press the O key to turn on the steam to Injector 2.)\n"+
	"2.	Press the K key to increase the water flow to Injector 1.\n"+
	"(To increase the water flow to Injector 2, press the L key.)\n\n"+
	"To stop boiler water injection\n"+ 
	"1. Press the I key to turn off the steam to Injector 1.\n"+
	"2. Press the O key to turn off the steam to Injector 2."
	)
)